test/exam-test-fixed.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="考试系统压力测试" enabled="true">
      <stringProp name="TestPlan.comments">测试1000名学生注册、登录和进入考试</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="baseUrl" elementType="Argument">
            <stringProp name="Argument.name">baseUrl</stringProp>
            <stringProp name="Argument.value">http://localhost:8080</stringProp>
          </elementProp>
          <elementProp name="registerPath" elementType="Argument">
            <stringProp name="Argument.name">registerPath</stringProp>
            <stringProp name="Argument.value">/api/auth/register</stringProp>
          </elementProp>
          <elementProp name="loginPath" elementType="Argument">
            <stringProp name="Argument.name">loginPath</stringProp>
            <stringProp name="Argument.value">/api/auth/login</stringProp>
          </elementProp>
          <elementProp name="enterExamPath" elementType="Argument">
            <stringProp name="Argument.name">enterExamPath</stringProp>
            <stringProp name="Argument.value">/api/student/exams/${examId}/enter</stringProp>
          </elementProp>
          <elementProp name="password" elementType="Argument">
            <stringProp name="Argument.name">password</stringProp>
            <stringProp name="Argument.value">student123</stringProp>
          </elementProp>
          <elementProp name="userPrefix" elementType="Argument">
            <stringProp name="Argument.name">userPrefix</stringProp>
            <stringProp name="Argument.value">student</stringProp>
          </elementProp>
          <elementProp name="startIndex" elementType="Argument">
            <stringProp name="Argument.name">startIndex</stringProp>
            <stringProp name="Argument.value">4</stringProp>
          </elementProp>
          <elementProp name="userCount" elementType="Argument">
            <stringProp name="Argument.name">userCount</stringProp>
            <stringProp name="Argument.value">1000</stringProp>
          </elementProp>
          <elementProp name="examId" elementType="Argument">
            <stringProp name="Argument.name">examId</stringProp>
            <stringProp name="Argument.value">1</stringProp>
          </elementProp>
          <elementProp name="rampUpSeconds" elementType="Argument">
            <stringProp name="Argument.name">rampUpSeconds</stringProp>
            <stringProp name="Argument.value">60</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
    </TestPlan>
    <hashTree>
      <!-- 简化HTTP默认配置 -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP默认配置">
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">8080</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
      </ConfigTestElement>
      <hashTree/>
      
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP头管理器">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Content-Type" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="Cookie管理器"/>
      <hashTree/>
      
      <!-- 线程组1: 注册用户 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="01-注册用户">
        <stringProp name="ThreadGroup.num_threads">${userCount}</stringProp>
        <intProp name="ThreadGroup.ramp_time">20</intProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <!-- 修复的用户名生成器 -->
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="生成用户名">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
// 获取起始索引
int startIdx = Integer.parseInt(vars.get("startIndex"));
int threadNum = ctx.getThreadNum();
int userNumber = startIdx + threadNum;

// 生成用户名: student4, student5, ... student1003
String username = vars.get("userPrefix") + userNumber;
vars.put("username", username);
vars.put("userNumber", userNumber.toString());

// 日志输出
log.info("注册用户: " + username + " (线程: " + threadNum + ")");
]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        
        <!-- 注册请求 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="用户注册">
          <stringProp name="HTTPSampler.path">${registerPath}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;username&quot;:&quot;${username}&quot;,&quot;userpassword&quot;:&quot;${password}&quot;,&quot;userRole&quot;:1}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="验证注册成功">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49561">2</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      
      <!-- 线程组2: 登录并进入考试 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="02-登录并进入考试">
        <stringProp name="ThreadGroup.num_threads">${userCount}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampUpSeconds}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <!-- 同样的用户名生成器 -->
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="生成用户名(与注册相同)">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
// 使用与注册时相同的逻辑生成用户名
int startIdx = Integer.parseInt(vars.get("startIndex"));
int threadNum = ctx.getThreadNum();
int userNumber = startIdx + threadNum;

String username = vars.get("userPrefix") + userNumber;
vars.put("username", username);
vars.put("userNumber", userNumber.toString());

log.info("登录用户: " + username + " (线程: " + threadNum + ")");
]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        
        <!-- 登录请求 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="用户登录">
          <stringProp name="HTTPSampler.path">${loginPath}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;username&quot;:&quot;${username}&quot;,&quot;userpassword&quot;:&quot;${password}&quot;}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- 提取studentId -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="提取studentId">
            <stringProp name="JSONPostProcessor.referenceNames">studentId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.userId</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">-1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="验证登录成功">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49561">2</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        
        <!-- 进入考试请求 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="进入考试">
          <stringProp name="HTTPSampler.path">${enterExamPath}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;studentId&quot;:${studentId}}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="验证进入考试成功">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49561">2</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      
      <!-- 结果收集器 -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="汇总报告">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>